tutorials/magnetoconvectionFoam/siqueira_2020/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              8.45e-6;

// Thermal expansion coefficient
beta            38.5e-5;

// Reference temperature
TRef            0;

// Laminar Prandtl number
Pr              100.0;

// Turbulent Prandtl number
Prt             110.0;

rho		1.42e+3;		// density (EFH3 TDS)
// ************************************************************************* //
